      * primeiro programa em COBOL
       IDENTIFICATION DIVISION.
      * INCLUSAO DE INFORMACOES DOCUMENTAIS
       PROGRAM-ID. HELLO.
       ENVIRONMENT DIVISION.
      * DESCREVE O COMPUTADOR ONDE O PROGRAMA ESTA SENDO ESCRITO
       DATA DIVISION.
      * ARQUIVOS DE ENTRADA E SAIDA, VARIAVEIS E CONSTANTES
       PROCEDURE DIVISION.
      *CONTEM O CODIGO QUE IRA MANIPULAR OS DADOS E INCLUIR O ALGR DP 
      *PROGRAMA
           DISPLAY "HELLO WORD".
           STOP RUN. 
           


       